/**
 * CSS定位机制:(普通流、浮动和绝对定位)
 *      除非专门指定,否则所有框都在普通流中定位. 也就是说,普通流中的元素的位置由元素在(X)HTML中的位置决定.
 *
 *      块级框从上到下一个接一个地排列, 框之间的垂直距离是由框的"垂直外边距"计算出来.
 *
 *      行内框在一行中水平布置. 可以使用水平内边距, 边框和外边距调整它们的间距. 但是,垂直内边距,边框和外边距
 *      不影响行内框的高度. 由一行形成的水平框称为行框(Line Box),行框的高度总是足以容纳它包含的所有行内框.
 *      不过，设置行高可以增加这个框的高度.
 *
 * position 属性值的含义:
 *      static: 元素框正常生成. 块级元素生成一个矩形框,作为文档流的一部分,行内元素则会创建一个或多个行框,置于其父元素中.
 *      relative: 元素框偏移某个距离.元素仍保持其未定位前的形状,它原本所占的空间仍保留.
 *      absolute: 元素框从文档流完全删除,并相对于其包含块定位. 包含块可能是文档中的另一个元素或者是初始包含块. 元素原先在
 *                正常文档流中所占的空间会关闭,就好像元素原来不存在一样. 元素定位后生成一个块级框,而不论原来它在正常流中
 *                生成何种类型的框.
 *      fixed: 元素框的表现类似于将position设置为absolute, 不过其包含块是视窗本身.
 *
 * float定位(浮动定位):
 *      有两个取值：left(左浮动)和right(右浮动). 浮动元素会在没有浮动元素的上方,效果上看是遮挡住了没有浮动的元素, 有float样式
 *      规则的元素是脱离文档流的,它的父元素的高度并不能有它撑开.
 *
 * top, left, right, bottom  定义了一个定位元素的{x}外边距边界与其包含块{x}边界之间的偏移.
 * overflow: 设置当元素的内容溢出其区域时发生的事情.(hidden:内容会被修剪,并且其余内容是不可见的. scroll:内容会被修剪,
 *           但是浏览器会显示滚动条以便查看其余的内容. visible(默认): 内容不会被修剪,会呈现在元素框之外)
 * clip:rect(top,right,bottom,left) 零坐标是图片的左上角的点, top,right,bottom,left是截取后的图片边相对零点的距离.
 *          元素被剪入这个形状之中,然后显示出来.
 *
 * vertical-align: 设置元素的垂直对齐方式(baseline: 默认.元素放置在父元素的基线上.  middle:把此元素放置在父元素的中部.
 *          top(bottom):把元素的顶端与行中最高元素的顶端对齐. text-top(text-bottom):把元素的顶端与父元素字体的顶端对齐.
 *          %: 使用 "line-height" 属性的百分比值来排列此元素, 允许负值)
 * z-index:  设置堆叠方式. 决定哪个元素位于上面?
 *
 * transform: rotate({n}deg) 旋转n度,n可以为正数，也可以为负数.
 *
 *
 *
 * 文本属性:
 *      direction: 文本书写方向(ltr:从左到右(默认); rtl:从右到左)
 *      line-height: 设置行高(number: 设置数字,此数字会与当前的字体尺寸相乘来设置行间距;
 *                   length: 设置固定的行间距; %: 基于当前字体尺寸的百分比行间距)
 *      text-align: 设置文本的水平对齐方式(left, center, right)
 *      text-decoration: 添加到文本的装饰效果(none: 没有; underline: 文本下划线; overline: 文本上划线;
 *                       line-through: 文本中划线; blink: 闪烁的文本)
 *      text-indent: 首行缩进(length: 默认是0,设置固定的宽度; %:基于父元素的百分比)
 *      word-spacing: 设置单词间距(length: 设置固定的长度)
 *      text-overflow: 文本溢出,需要先设置overflow(clip:修剪文本(默认); ellipsis: 显示省略符号来代表被修剪的文本;)
 *      white-space: 设置如何处理元素内的空白(normal: 默认.空白会被浏览器忽略; pre: 保留空白; nowrap: 文本不会换行,
 *                   文本在同一行上继续,直到遇到<br>标签为止; pre-wrap: 保留空白符序列,但是正常的进行换行;  pre-line:
 *                   合并空白符序列,但是保留换行符)
 *     text-shadow: text-shadow: h-shadow v-shadow blur color; 向文本添加一个或多个阴影. h-shadow,水平阴影的位置(
 *                  允许负值); v-shadow: 垂直阴影的位置(允许负值); blur: 模糊的距离(可选); color: 阴影的颜色(可选)
 *     word-wrap: 允许长单词或URL地址换行到下一行. (normal: 只在允许的断字点换行(默认);  break-word: 在长单词或URL地址
 *                内部进行换行)
 *     word-break: 自动换行的处理方法(normal: 浏览器默认的换行规则; break-all: 允许在单词内进行换行; keep-all: 只能在
 *                 半角空格或者连字符处换行)
 */